Add more details to Readme.md
